DSCore.IO.FilePath
Methods for operating on strings representing file paths.

DSCore.IO.FilePath.Combine(System.String[])
Combines multiple strings into a single file path.
paths: String to combine into a path.

DSCore.IO.FilePath.Extension(System.String)
Gets the extension from a file path.
path: Path to get extension of.

DSCore.IO.FilePath.ChangeExtension(System.String,System.String)
Changes the extension of a file path.
path: Path to change extension of.
newExtension: New extension.

DSCore.IO.FilePath.DirectoryName(System.String)
Gets the directory name of a file path.
path: Path to get directory information of.

DSCore.IO.FilePath.FileName(System.String,System.Boolean)
Gets the file name of a file path.
path: Path to get the file name of.
withExtension: Determines whether or not the extension is included in the result, defaults to true.

DSCore.IO.FilePath.HasExtension(System.String)
Determines whether or not a file path contains an extension.
path: Path to check for an extension.