DSCore.Color.Brightness(DSCore.Color)
Gets the brightness value for this color.
double between 0 and 1 inclusive.

DSCore.Color.Saturation(DSCore.Color)
Gets the saturation value for this color.
double between 0 and 1 inclusive.

DSCore.Color.Hue(DSCore.Color)
Gets the hue value for this color.
double between 0 and 1 inclusive.

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Get a color from a color gradient between a start color and an end color.
parameters: The values between 0 and 1 along the range for which you would like to sample the color.
Colors in the given range.
color,range,gradient

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Bilinearly interpolate between a set of colors.
start: The start color.
end: The end color.
t: A parameter between 0.0 and 1.0.
Returns: The interpolated color or white.

DSCore.Color.Red
Find the red component of a color, 0 to 255.
int between 0 and 255 inclusive.

DSCore.Color.Green
Find the green component of a color, 0 to 255.
int between 0 and 255 inclusive.

DSCore.Color.Blue
Find the blue component of a color, 0 to 255.
int between 0 and 255 inclusive.

DSCore.Color.Alpha
Find the alpha component of a color, 0 to 255.
int between 0 and 255 inclusive.