DSCore.List.UniqueItems(System.Collections.IList)
Creates a new list containing all unique items in the given list.
list: List to filter duplicates out of.
Filtered list.
removes,duplicates,remove duplicates,cull duplicates,distinct

DSCore.List.ContainsItem(System.Collections.IList,System.Object)
Determines if the given list contains the given item.
list: List to search in.
item: Item to look for.
Whether list contains the given item.
item,search,in

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Build sublists from a list using DesignScript range syntax.
list: The list from which to create sublists.
ranges:
The index ranges of the sublist elements.
Ex. \"{0..3,5,2}\"
offset:
The offset to apply to the sublist.
Ex. the range \"0..3\" with an offset of 2 will yield
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
keepIncomplete:
Determines if ranges where some indices are out of bounds are kept.
If true (default): All ranges are kept, out of bounds indices are ommitted.
If false: Any ranges with out of bounds indices are ommitted.
Sublists of the given list.
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Sorts a list using the built-in natural ordering.
list: List to be sorted.
Sorted list.
sort,order,sorted

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filters a sequence by lookng up corresponding indices in a separate list of
booleans.
list: List to filter.
mask: List of booleans representing a mask.
Items whose mask index is true.
Items whose mask index is false.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Given a list, produces the first item in the list, and a new list containing all items
except the first.
list: List to be split.
First item in the list.
Rest of the list.
first,rest,list split

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Adds an item to the beginning of a list.
item: Item to be added.
list: List to add on to.
New list.
insert,add,item,front,start,begin

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Removes an amount of items from the start of the list.
list: List to remove items from.
amount:
Amount of items to remove. If negative, items are removed from the end of the list.
List of remaining items.
drop,remove,shorten

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Gets an item from the given list that's located at the specified index.
list: List to fetch an item from.
index: Index of the item to be fetched.
Item in the list at the given index.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Gets a single sub-list from the given list, based on starting index, ending index,
and a step amount.
list: List to take a slice of.
start: Index to start the slice from.
end: Index to end the slice at.
step:
Amount the indices of the items are separate by in the original list.
Items in the slice of the given list.
list,sub,sublist,subrange,get sublist

DSCore.List.IsEmpty(System.Collections.IList)
Determines if the given list is empty.
list: List to check for items.
Whether the list is empty.
test,is,empty,null,count

DSCore.List.Count(System.Collections.IList)
Gets the number of items stored in the given list.
list: List to get the item count of.
List length.
listlength,list length,count,size,sizeof

DSCore.List.FirstItem(System.Collections.IList)
Gets the first item in a list.
list: List to get the first item from.
First item in the list.
get,fetch,first,item,start

DSCore.List.Chop(System.Collections.IList,System.Int32)
Chop a list into a set of lists each containing the given amount of items.
list: List to chop up.
subLength: Length of each new sub-list.
List of lists.
sublists,build sublists,slices,partitions,cut

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
List elements along each diagonal in the matrix from the top left to the lower right.
list: A flat list
subLength: Length of each new sub-list.
Lists of elements along matrix diagonals.
diagonal,right,matrix,get diagonals,diagonal sublists,

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
List elements along each diagonal in the matrix from the top right to the lower left.
list: A flat list.
rowLength: Length of each new sib-list.
Lists of elements along matrix diagonals.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Swaps rows and columns in a list of lists.
If there are some rows that are shorter than others,
null values are inserted as place holders in the resultant
array such that it is always rectangular.
lists: A list of lists to be transposed.
A list of transposed lists.
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Cleans data of nulls and empty lists from a given list of arbitrary dimension
list:
preserveIndices: Provide an option to preserve the indices of the data
such that non-trailing nulls may not be filtered out
Returns: A list cleaned of nulls and empty lists

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Creates a list containing the given item the given number of times.
item: The item to repeat.
amount: The number of times to repeat.
List of repeated items.
repeat,repeated,duplicate,list of item,fill list,copies

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Creates a new list by concatenining copies of a given list.
list: List to repeat.
amount: Number of times to repeat.
List of repeated lists.
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Retrieves the last item in a list.
list: List to get the last item of.
Last item in the list.
get,fetch,last,item,end of list

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Given an item, returns the zero-based indices of all its occurrences
in the list. If the item cannot be found, an empty list is returned.
list:
List to search in. If this argument is null, an empty list is returned.
item: Item to look for.
Returns: A list of zero-based indices of all occurrences of the item if
found, or an empty list if the item does not exist in the list.

DSCore.List.Empty
An Empty List.
Empty list.
empty list, emptylist,[]