DSCore.Math.PI
The mathematical constant Pi, 3.14159...
double. The constant Pi.
3.141592653589793

DSCore.Math.E
The mathematical constant e, 2.71828...
double. The constant e.
exp,2.718281828459045

DSCore.Math.GoldenRatio
The golden ratio, (1 + sqrt(5))/2 = 1.61803...
double. The golden ratio.
golden,ratio,divine,phi,tau,1.61803398875