DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Yields a new TimeSpan calculated from the time difference between two DateTimes.
date1: Starting DateTime.
date2: Ending DateTime.
TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new TimeSpan from a span of time.
days: Days spanned.
hours: Hours spanned.
minutes: Minutes spanned.
seconds: Seconds spanned.
milliseconds: Milliseconds spanned.
TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplies a TimeSpan by a scaling factor.
timeSpan: A TimeSpan.
scaleFactor:
Amount to scale the TimeSpan. For example, a scaling factor of 2 will yield
double the amount of time spanned.
TimeSpan

DSCore.TimeSpan.Negate(System.TimeSpan)
Negates a TimeSpan.
timeSpan: A TimeSpan.
TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Adds two TimeSpans.
timeSpan1: A TimeSpan.
timeSpan2: A TimeSpan.
TimeSpan

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Subtracts two TimeSpans.
timeSpan1: A TimeSpan.
timeSpan2: A TimeSpan.
TimeSpan

DSCore.TimeSpan.FromString(System.String)
Attempts to parse a TimeSpan from a string.
str: String representation of a TimeSpan.
TimeSpan

DSCore.TimeSpan.Components(System.TimeSpan)
Extracts the individual components of a TimeSpan.
timeSpan: A TimeSpan.

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of days.
timeSpan: A TimeSpan.

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of hours.
timeSpan: A TimeSpan.

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of minutes.
timeSpan: A TimeSpan.

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of seconds.
timeSpan: A TimeSpan.

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of milliseconds.
timeSpan: A TimeSpan.

DSCore.TimeSpan.Zero
A TimeSpan representing an elapsed time of Zero.
TimeSpan

DSCore.TimeSpan.MaxValue
The largest TimeSpan that can be represented.
TimeSpan

DSCore.TimeSpan.MinValue
The smallest TimeSpan that can be represented.
TimeSpan