DSCore.IO.Directory
Methods for working with Directories.

DSCore.IO.Directory.Move(System.String,System.String,System.Boolean)
Moves a directory to a new location.
path:
newPath:
overwriteFiles:

DSCore.IO.Directory.Copy(System.IO.DirectoryInfo,System.String,System.Boolean)
Copies a directory to a destination location.
directory: Directory to copy.
destinationPath: Destination of the copy operation on disk.
overwriteFiles:

DSCore.IO.Directory.Delete(System.String,System.Boolean)
Deletes a directory.
path: Path to a directory on disk.
recursive: Whether or not to delete all contents of the directory, defaults to false.

DSCore.IO.Directory.Contents(System.IO.DirectoryInfo,System.String)
Gets all of the contents of a given directory.
directory: Directory to get contents of.
searchString: Search string used to filter results. Defaults to "*.*" (displays all contents).

DSCore.IO.Directory.Exists(System.String)
Determines if a directory exists at the given path.
path: Path to a directory on disk.