DSCore.ColorRange2D.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Create a ColorRange2D by supplying lists of colors and UVs.
colors: A list of colors.
parameters: A list of parameters between (0.0,0.0) and (1.0,1.0).
Returns: A ColorRange1D object.

DSCore.ColorRange2D.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Get the color in this color range at the specified parameter.
parameter: A UV between (0.0,0.0) and (1.0,1.0).
Returns: A Color.