DSCore.IO.File
Methods for working with Files.

DSCore.IO.File.ReadText(System.IO.FileInfo)
Reads a text file and returns the contents as a string.
Contents of the text file.
read file,text,file

DSCore.IO.File.Move(System.String,System.String,System.Boolean)
Moves a specified file to a new location
path:
newPath:
overwrite:

DSCore.IO.File.Delete(System.String)
Deletes the specified file.
path:

DSCore.IO.File.Copy(System.IO.FileInfo,System.String,System.Boolean)
Copies a file.
file:
destinationPath:
overwrite:

DSCore.IO.File.Exists(System.String)
Determines if a file exists at the given path.
path:

DSCore.IO.File.WriteText(System.String,System.String)
Write the text content to a file specified by the path
filePath: Path to write to
text: Text content
write file,text,file