DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Loads the file as a bitmap.
file: File object to load image from.
Image

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Reads an image file and returns the color values at the specified grid locations.
image: The image to read.
xSamples: Number of sample grid points in the X direction.
ySamples: Number of sample grid points in the Y direction.
Colors at the specified grid points.
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Constructs an image from a 2d list of pixels.
colors: 2d rectangular list of colors representing the pixels.
Image

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Constructs an image from a flat list of pixels, a width, and a height.
colors: List of colors representing the pixels.
width: Width of the new image, in pixels.
height: Height of the new image, in pixels.
Image

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Gets the width and height of an image.
image: Image to get dimensions of.

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Write the image to a path, given the specified file name.
path:
image: The image to write
It is successful or not.
write image,image,file