DSCore.IO.CSV
Methods for working with CSV (comma-separated values) files.

DSCore.IO.CSV.WriteToFile(System.String,System.Object[][])
Write a list of lists into a file using a comma-separated values
format. Outer list represents rows, inner lists represent columns.
filePath: Path to write to
data: List of lists to write into CSV
Contents of the text file.
write,text,file

DSCore.IO.CSV.ReadFromFile(System.IO.FileInfo)
Reads a text file containing comma-separated values into a two dimensional list.
Outer list represents rows, inner lists represent columns.
file: File object to read from.
Returns: CSV contents of the given file.