DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Construct a Quadtree encompassing the (0,0)->(1,1) domain.
uv: A set of UVs in the (0,0)->(1,1) domain.
Returns: A Quadtree object.