DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Creates a new DateTime at an exact date.
year: Exact year (1-9999)
month: Exact month (1-12)
day: Exact day (1-[days in month])
DateTime

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Creates a new DateTime at an exact date and time.
year: Exact year (1-9999)
month: Exact month (1-12)
day: Exact day (1-[days in month])
hour: Exact hour (0-23)
minute: Exact minute (0-59)
second: Exact second (0-59)
millisecond: Exact millisecond (0-999)
DateTime

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Subtracts a TimeSpan from a DateTime, yielding a new DateTime.
dateTime: Starting DateTime.
timeSpan: Amount of time to subtract.
DateTime

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Adds a TimeSpan to a DateTime, yielding a new DateTime.
dateTime: Starting DateTime.
timeSpan: Amount of time to add.
DateTime

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calculates how many days are in the given month of the given year.
year: Exact year (1-9999)
month: Exact month (1-12)

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Determines if it is Daylight Savings Time at the given DateTime.
dateTime: A DateTime.

DSCore.DateTime.IsLeapYear(System.Int32)
Determines if the given year is a leap year.
year: Exact year (1-9999)

DSCore.DateTime.FromString(System.String)
Attempts to parse a DateTime from a string.
str: String representation of a DateTime.
DateTime

DSCore.DateTime.Date(System.DateTime)
Extracts only the date from a DateTime. Time components are set to 0.
dateTime: A DateTime.

DSCore.DateTime.Components(System.DateTime)
Extracts the individual components of a DateTime.
dateTime: A DateTime.

DSCore.DateTime.DayOfWeek(System.DateTime)
Gets the Day of the Week from a given DateTime.
dateTime: A DateTime object.
Day of the week

DSCore.DateTime.DayOfYear(System.DateTime)
Returns the day of the year (0-366)
dateTime: A DateTime.

DSCore.DateTime.TimeOfDay(System.DateTime)
Yields a new TimeSpan representing the amount of time passed since midnight of the
given DateTime.
dateTime: A DateTime.

DSCore.DateTime.MinValue
The earliest date and time that can be represented.
DateTime

DSCore.DateTime.MaxValue
The latest date and time that can be represented.
DateTime

DSCore.DateTime.Now
The current system date and time.
DateTime

DSCore.DateTime.Today
The current system date, with time set at midnight.
DateTime